tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Fonts
# https://github.com/Homebrew/homebrew-cask-fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-mono-for-powerline"
cask "font-ibm-plex"
cask "font-ibm-plex-mono"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-inconsolata"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
#

# Tools
# https://aws.amazon.com/cli/
# https://github.com/rust-lang/rustup/
# http://mama.indstate.edu/users/ice/tree/
# https://direnv.net/
# https://git-scm.com/
# https://github.com/ajeetdsouza/zoxide
# https://github.com/ajeetdsouza/zoxide
# https://github.com/BurntSushi/ripgrep
# https://github.com/dandavison/delta
# https://github.com/github/gh
# https://github.com/junegunn/fzf
# https://github.com/neovim/neovim
# https://jonas.github.io/tig/
# https://jqlang.github.io/jq/
# https://tmux.github.io/
# https://volta.sh/
# https://www.gnu.org/software/coreutils/
# https://www.ruby-lang.org/
# https://starship.rs/
#
brew "awscli"
brew "colordiff"
brew "coreutils"
brew "direnv"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git"
brew "jq"
brew "neovim"
brew "ripgrep"
brew "ruby"
brew "rustup-init"
brew "starship"
brew "tig"
brew "tmux"
brew "tree"
brew "volta"
brew "zoxide"
brew "zoxide"
